package com.example.prilogulka;

import com.example.prilogulka.data.Districts;

import org.junit.Assert;
import org.junit.Before;
import org.junit.Test;

public class DistrictsTest {
    Districts districts;

    public static final String[] firstGroup = {
            "г. Москва", "г. Санкт-Петербург", "Ханты-Мансийский автономный округ",
            "Республика Татарстан", "Ямало-Ненецкий автономный округ", "Московская область", "Тюменская область",
            "Свердловская область", "Ленинградская область", "Краснодарский край", "Республика Башкортостан",
            "Самарская область", "Белгородская область", "Пермский край", "Красноярский край", "Воронежская область",
            "Сахалинская область", "Нижегородская область", "Липецкая область", "Ростовская область"
    };

    public static final String[] secondGroup = {
            "Республика Саха (Якутия)", "Челябинская область", "Калужская область", "Кемеровская область",
            "Республика Коми", "Приморский край", "Вологодская область", "Новосибирская область",
            "Иркутская область", "Курская область", "Тульская область", "Рязанская область",
            "Оренбургская область", "Волгоградская область", "Удмуртская Республика", "Мурманская область",
            "Хабаровский край", "Саратовская область", "Омская область", "Республика Крым",
            "Ставропольский край", "Архангельская область", "Владимирская область"
    };

    public static final String[] thirdGroup = {
            "Калининградская область", "Томская область", "Ярославская область", "Республика Дагестан",
            "Тверская область", "Ульяновская область", "Ненецкий автономный округ", "Амурская область",
            "Алтайский край", "Кировская область", "Тамбовская область", "Камчатский край",
            "Брянская область", "Пензенская область", "Чувашская Республика", "Астраханская область",
            "Новгородская область", "Смоленская область", "Магаданская область",
            "Чеченская Республика", "Республика Марий Эл"
    };

    public static final String[] fourthGroup = {
            "Забайкальский край", "г. Севастополь", "Республика Мордовия", "Ивановская область",
            "Орловская область", "Республика Бурятия", "Республика Хакасия", "Чукотский автономный округ",
            "Республика Карелия", "Курганская область", "Псковская область", "Республика Адыгея",
            "Костромская область", "Карачаево-Черкесская Республика", "Республика Северная Осетия – Алания",
            "Республика Калмыкия", "Кабардино-Балкарская Республика", "Республика Алтай",
            "Республика Ингушетия", "Республика Тыва", "Еврейская автономная область"
    };

    @Before
    public void init() {
        districts = new Districts();
    }

    @Test
    public void massTestDistricts12() {
        for (int i = 0; i < firstGroup.length; i++)
            Assert.assertEquals(districts.getDistrictCoefficient(firstGroup[i]), 1.2, 0.0);
    }
    @Test
    public void massTestDistricts10() {
        for (int i = 0; i < firstGroup.length; i++)
            Assert.assertEquals(districts.getDistrictCoefficient(secondGroup[i]), 1.0, 0.0);
    }
    @Test
    public void massTestDistricts09() {
        for (int i = 0; i < firstGroup.length; i++)
            Assert.assertEquals(districts.getDistrictCoefficient(thirdGroup[i]), 0.9, 0.0);
    }
    @Test
    public void massTestDistricts08() {
        for (int i = 0; i < firstGroup.length; i++)
            Assert.assertEquals(districts.getDistrictCoefficient(fourthGroup[i]), 0.8, 0.0);
    }

}
